performance.yml
modules:
  jmeter:
    properties:
      https.default.protocol: TLSv1.2

execution:
- concurrency: 3
  ramp-up: 1s
  hold-for: 2s
  scenario: quick-test

scenarios:
  quick-test:
    requests:
    - http://taurus-project-x.testing.acp.homeoffice.gov.uk/performance/test-one

reporting:
- module: final-stats
  summary: true
  percentiles: true
  failed-labels: false
  test-duration: true
  dump-xml: taurus_artifacts/report.xml
  dump-csv: taurus_artifacts/report.csv